Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСистемныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолПредПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Утверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Бюджет/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ВводНаОсновании.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюСоздатьНаОсновании);
	
	МенюОтчеты.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюОтчеты);
	
КонецПроцедуры
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОбновитьФильтрПериода();
	ОбновитьФильтрСтатусов(ФильтрСтатусы.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		текДанные = Строка.Значение.Данные;
		Строка.Значение.Оформление["Период"].Элементы[8].Значение = ПредставлениеПериода(текДанные.ДатаНачала, КонецДня(текДанные.ДатаОкончания));
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокСтатусов()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 	Ссылка Значение, ВЫБОР КОГДА Ссылка В(&Отмеченные) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ Пометка
	|ИЗ 		Перечисление.СтатусыБюджета
	|");
	
	Запрос.УстановитьПараметр("Отмеченные", ФильтрСтатусы.ВыгрузитьЗначения());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат КонвертацияТипов.ПолучитьСписокЗначенийИзВыборки(Выборка,,,"Пометка");
	
КонецФункции

Процедура ОбновитьФильтрСтатусов(ВыбСтатусы)
	
	Если ФильтрСтатусы.Количество() Тогда
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Статус", ВыбСтатусы, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Список, "Статус");
	КонецЕсли;
	
КонецПроцедуры
Процедура ОбновитьФильтрПериода()
	
	Если ФильтрПериод.ДатаНачала = '00010101' Тогда
		
		Список.Параметры.УстановитьЗначениеПараметра("ФильтрПериод", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 		'00010101');
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	'00010101');
		ФильтрПериодСтр = "за все время";
		
	Иначе
		
		Список.Параметры.УстановитьЗначениеПараметра("ФильтрПериод", 	Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 		ФильтрПериод.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	ФильтрПериод.ДатаОкончания);
		
		ФильтрПериодСтр = ПредставлениеПериода(ФильтрПериод.ДатаНачала, КонецДня(ФильтрПериод.ДатаОкончания));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтмеченныСтатусы(ВыбСписок, ДопПараметры) Экспорт
	
	Если ВыбСписок <> Неопределено Тогда
		
		ВыбСтатусы = КонвертацияТипов.ПолучитьОтмеченныеЗначенияСписка(ВыбСписок);
		ФильтрСтатусы.ЗагрузитьЗначения(ВыбСтатусы);
		
		ОбновитьФильтрСтатусов(ВыбСтатусы);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ФильтрСтатусыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПолучитьСписокСтатусов().ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ОтмеченныСтатусы", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусыОчистка(Элемент, СтандартнаяОбработка)
	
	ОтмеченныСтатусы(Новый СписокЗначений, Новый Структура);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбранПериод(текпериод, ДопСвойства) Экспорт
	
	Если текПериод <> Неопределено Тогда
		ФильтрПериод = текпериод;
		ОбновитьФильтрПериода();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ФильтрПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ФильтрПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбранПериод", ЭтаФорма));
	
КонецПроцедуры
&НаКлиенте
Процедура ФильтрПериодПриИзменении(Элемент)
	
	ОбновитьФильтрПериода();
	
КонецПроцедуры
&НаКлиенте
Процедура ФильтрПериодОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФильтрПериод.ДатаНачала = '00010101';
	ОбновитьФильтрПериода();
	
КонецПроцедуры
